app/Controllers/PesananController.php

SELECT *
FROM `transaksi`
---
			public function index()
			{
				$data['transaksis'] = $this->transaksi->findAll();

UPDATE `transaksi` SET `status` = '2'
WHERE `transaksi`.`id` IN ('10')
---
			public function edit($id)
			{
				$data = $this->request->getPost();
				if($data){
					if($data){
						if($data){
							$dataForm =[
								'status' => $this -> request -> getPost('status'),
							];
						}
					}
					$this->transaksi->update($id, $dataForm);